#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция ВидСтавки(СтавкаНДС) Экспорт
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		Возврат Перечисления.ВидыСтавокНДС.Общая;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		Возврат Перечисления.ВидыСтавокНДС.ОбщаяРасчетная;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		Возврат Перечисления.ВидыСтавокНДС.Пониженная;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		Возврат Перечисления.ВидыСтавокНДС.ПониженнаяРасчетная;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
		Возврат Перечисления.ВидыСтавокНДС.Нулевая;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		Возврат Перечисления.ВидыСтавокНДС.БезНДС;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		Возврат Перечисления.ВидыСтавокНДС.Общая;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
		Возврат Перечисления.ВидыСтавокНДС.ОбщаяРасчетная;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда
		Возврат Перечисления.ВидыСтавокНДС.Общая;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС22_122 Тогда
		Возврат Перечисления.ВидыСтавокНДС.ОбщаяРасчетная;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС7 Тогда
		Возврат Перечисления.ВидыСтавокНДС.ОбщаяУСН;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС5 Тогда
		Возврат Перечисления.ВидыСтавокНДС.ПониженнаяУСН;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС7_107 Тогда
		Возврат Перечисления.ВидыСтавокНДС.ОбщаяУСНРасчетная;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС5_105 Тогда
		Возврат Перечисления.ВидыСтавокНДС.ПониженнаяУСНРасчетная;
	Иначе
		Возврат Перечисления.ВидыСтавокНДС.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли