
#Область ПрограммныйИнтерфейс

Функция ТипЗапросаДанныеОтчетности() Экспорт
	
	Возврат "ДанныеОтчетности";
	
КонецФункции

Функция ТипЗапросаСписокОрганизаций() Экспорт
	
	Возврат "СписокОрганизаций";
	
КонецФункции

Функция ТипЗапросаЗаписатьСтатусОтчета() Экспорт
	
	Возврат "СтатусОтчета";
	
КонецФункции

Функция ТипЗапросаЗаписатьКомментарийОтчета() Экспорт
	
	Возврат "КомментарийОтчета";
	
КонецФункции

Функция ТипЗапросаПодключитьОблачноеПриложение() Экспорт
	
	Возврат "ПодключитьОблачноеПриложение";
	
КонецФункции

#КонецОбласти