Процедура ОткрытьФормуОбновлениеДрайверов() Экспорт
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ПредложитьОбновитьДрайвера",,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

Процедура ПриОткрытииСменыНаККТ(ИдентификаторУстройстваККТ, ПараметрыРегистрации) Экспорт
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИдентификаторУстройстваККТ", ИдентификаторУстройстваККТ);
	ПараметрыФормы.Вставить("ПараметрыРегистрации",       ПараметрыРегистрации);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверкаДрайверовЗавершение", ЭтотОбъект, ПараметрыФормы);
	Если МенеджерОборудованияБПВызовСервера.ТребуетсяОбновлениеДрайвера(ИдентификаторУстройстваККТ) Тогда
		ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ПредложитьОбновитьДрайвера",
			Новый Структура("ИдентификаторОборудования", ИдентификаторУстройстваККТ),,,,,
			ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
	ИначеЕсли ОписаниеОповещения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещения);	
		
	КонецЕсли;
КонецПроцедуры
	
Процедура ПроверкаДрайверовЗавершение(Значение, ПараметрыФормы) Экспорт
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ПроверкаСНОДляККТ", 
		ПараметрыФормы, 
		, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

