#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.НеоплаченныеСчетаПокупателям.Видимость = 
		ПравоДоступа(
			"Просмотр",
			Метаданные.Документы.СчетНаОплатуПокупателю);
			
	Элементы.НеоплаченныеСчетаПоставщикам.Видимость = 
		ПравоДоступа(
			"Просмотр",
			Метаданные.Документы.СчетНаОплатуПоставщика);
	
	Продажи = ПравоДоступа(
			"Просмотр",
			Метаданные.Отчеты.Продажи);
			
	Элементы.ПродажиПоКонтрагентам.Видимость = Продажи;
	Элементы.ПродажиПоНоменклатуре.Видимость = Продажи;
	
	Элементы.ЗадолженностьПокупателей.Видимость = 
		ПравоДоступа(
			"Просмотр",
			Метаданные.Отчеты.ЗадолженностьПокупателей);
	
	Элементы.ЗадолженностьПокупателейПоСрокамДолга.Видимость = 
		ПравоДоступа(
			"Просмотр",
			Метаданные.Отчеты.ЗадолженностьПокупателейПоСрокамДолга);
	
	Элементы.ЗадолженностьПоставщикам.Видимость = 
		ПравоДоступа(
			"Просмотр",
			Метаданные.Отчеты.ЗадолженностьПоставщикам)
		И ПолучитьФункциональнуюОпцию("ИспользоватьДокументыПоступления");
	
	Элементы.ЗадолженностьПоставщикамПоСрокамДолга.Видимость = 
		ПравоДоступа(
			"Просмотр",
			Метаданные.Отчеты.ЗадолженностьПоставщикамПоСрокамДолга)
		И ПолучитьФункциональнуюОпцию("ИспользоватьДокументыПоступления");
	
	Элементы.ОстаткиДенежныхСредств.Видимость = 
		ПравоДоступа(
			"Просмотр",
			Метаданные.Отчеты.ОстаткиДенежныхСредств);
	
	Элементы.ПоступленияДенежныхСредств.Видимость = 
		ПравоДоступа(
			"Просмотр",
			Метаданные.Отчеты.ПоступленияДенежныхСредств);
	
	Элементы.РасходыДенежныхСредств.Видимость = 
		ПравоДоступа(
			"Просмотр",
			Метаданные.Отчеты.РасходыДенежныхСредств);
	
	ДанныеБухгалтерии = УправлениеДоступомБПВызовСервера.ПравоДоступаКДаннымБухгалтерии();
	
	Элементы.ГруппаСклад.Видимость = ДанныеБухгалтерии
		И ПолучитьФункциональнуюОпцию("ИспользоватьДокументыПоступления");
	Элементы.ГруппаАнализ.Видимость = ДанныеБухгалтерии;
	
КонецПроцедуры

#КонецОбласти
