#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ФункциональностьПрограммы.ИзменитьСвязанныеОбъектыВзаимодействияСЛидами(Значение);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	ПропуститьБизнесЛогикуПередЗаписью = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДополнительныеСвойства, "ПропуститьБизнесЛогикуПередЗаписью", Ложь);
	
	Если ОбменДанными.Загрузка Или ПропуститьБизнесЛогикуПередЗаписью Тогда
		Возврат;
	КонецЕсли;
	
	ТарификацияБП.КонстантаФункциональностиПередЗаписью(Метаданные().Имя, Значение, Отказ);

КонецПроцедуры

#КонецОбласти

#КонецЕсли