
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если МобильныйКлиентБПКлиент.ЭтоМобильныйКлиент() Тогда
		МобильныйКлиентБПКлиент.ПоказатьФормуНедоступнаяФункциональность(
			"Получить сведения об основных показателях бизнеса");
		Возврат;
	КонецЕсли;

	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("ОткрыватьВНовойЗакладке", Истина);
	ОткрытьФорму("ОбщаяФорма.МониторОсновныхПоказателей", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
