#Область СлужебныйПрограммныйИнтерфейс

// Возвращает параметры сервиса
// 
// Возвращаемое значение:
//   Структура:
//    * Использовать - Булево - Определяет используется ли сервис в прикладной конфигурации
//    * АдресСервиса - Строка - адрес сервиса по умолчанию
//
Функция ПараметрыСервиса() Экспорт
	
	ПараметрыСервиса = Новый Структура;
	ПараметрыСервиса.Вставить("Использовать", Ложь);
	ПараметрыСервиса.Вставить("АдресСервиса", Константы.АдресСервисаСтатусСамозанятого.Получить());
	
	ИнтеграцияСтатусСамозанятогоПереопределяемый.ПриОпределенииПараметров(ПараметрыСервиса);
	
	Возврат ПараметрыСервиса;
	
КонецФункции

#КонецОбласти
