#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТарификацияБП.КонстантаФункциональностиПередЗаписью(Метаданные().Имя, Значение, Отказ);
	
	Константы.ИспользуютсяДоговорыССамозанятыми.УстановитьЗначениеОпцииДоговорыССамозанятыми(
		Значение И Справочники.ДоговорыКонтрагентов.СуществуетДоговорССамозанятым());

КонецПроцедуры

#КонецОбласти

#КонецЕсли