
#Область ПрограммныйИнтерфейс

// Возвращает строковую константу, описывающую выборочную функциональность.
// 
// Возвращаемое значение:
//   - Строка
//
Функция ВыборочнаяФункциональность() Экспорт
	
	Возврат "Выборочная";
	
КонецФункции

// Возвращает строковую константу, описывающую полную функциональность.
// 
// Возвращаемое значение:
//   - Строка.
//
Функция ПолнаяФункциональность() Экспорт
	
	Возврат "Полная";
	
КонецФункции

// Возвращает строковую константу, описывающую основную функциональность.
// 
// Возвращаемое значение:
//   - Строка
//
Функция ОсновнаяФункциональность() Экспорт
	
	Возврат "Основная";
	
КонецФункции

// Возвращает имя события журнала регистрации для изменения функциональности.
// 
// Возвращаемое значение:
//   - Строка
//
Функция СобытиеЖурналаРегистрации() Экспорт
	
	Возврат НСтр("ru = 'Функциональность программы'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
	
КонецФункции

// Возвращает представление для раздела взаимодействия с лидами, которое отображается в формах для пользователя
//
// Возвращаемое значение:
//   Строка
//
Функция ПредставлениеРазделаЛиды() Экспорт
	
	Возврат НСтр("ru = 'Взаимодействие с лидами и покупателями'");
	
КонецФункции

// Возвращает наименование для раздела взаимодействия с лидами, которое отображается в формах для пользователя
//
// Возвращаемое значение:
//   Строка
//
Функция РазделЛиды() Экспорт
	
	Возврат "Лиды";
	
КонецФункции

#КонецОбласти