#Область ОписаниеПеременных

&НаКлиенте
Перем ОткрытыеФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоПросмотрСчетаОтПоставщиков = ПравоДоступа("Просмотр", Метаданные.Документы.СчетНаОплатуПоставщика);
	ЕстьПравоПросмотрПоступления = ПравоДоступа("Просмотр", Метаданные.Документы.ПоступлениеТоваровУслуг);
	ЕстьПравоПросмотрПоступлениеДопРасходов = ПравоДоступа("Просмотр", Метаданные.Документы.ПоступлениеДопРасходов);
	ЕстьПравоПросмотрКорректировкаПоступления = ПравоДоступа("Просмотр", Метаданные.Документы.КорректировкаПоступления);
	ЕстьПравоПросмотрВозвратыПоставщикам =
		ПравоДоступа("Просмотр", Метаданные.Документы.ВозвратТоваровПоставщику);
	ЕстьПравоПросмотрСчетаФактурыПолученные =
		ПравоДоступа("Просмотр", Метаданные.Документы.СчетФактураПолученный);
	ЕстьПравоПросмотрАктОРасхождениях =
		ПравоДоступа("Просмотр", Метаданные.Документы.АктОРасхождениях);
		
	Элементы.КорректировкаПоступления.Видимость = ЕстьПравоПросмотрКорректировкаПоступления;
	Элементы.СчетаОтПоставщиков.Видимость = ЕстьПравоПросмотрСчетаОтПоставщиков;
	Элементы.Поступление.Видимость = ЕстьПравоПросмотрПоступления;
	Элементы.СчетаФактурыПолученные.Видимость = ЕстьПравоПросмотрСчетаФактурыПолученные;
	Элементы.ВозвратыПоставщикам.Видимость = ЕстьПравоПросмотрВозвратыПоставщикам;
	Элементы.ПоступлениеДопРасходов.Видимость = ЕстьПравоПросмотрПоступлениеДопРасходов;
	Элементы.АктыОРасхождениях.Видимость = ЕстьПравоПросмотрАктОРасхождениях;
	
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура СчетаОтПоставщиков(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.СчетНаОплатуПоставщика.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Поступление(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПоступлениеТоваровУслуг.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеДопРасходов(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ПоступлениеДопРасходов.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаФактурыПолученные(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.СчетФактураПолученный.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПоступления(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.КорректировкаПоступления.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратыПоставщикам(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.ВозвратТоваровПоставщику.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура АктыОРасхождениях(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.АктОРасхождениях.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанели(ЭтотОбъект,
		"СчетаОтПоставщиков,Поступление,ПоступлениеДопРасходов,СчетаФактурыПолученные,ВозвратыПоставщикам");
	
КонецПроцедуры

#КонецОбласти
