#Область ОписаниеПеременных

&НаКлиенте
Перем ОткрытыеФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоПросмотрПомощникПолученияРНПТ = ПравоДоступа("Просмотр", Метаданные.Обработки.ПомощникПолученияРНПТ);
	ЕстьПравоПросмотрУведомленияДляПолученияРНПТ = ПравоДоступа("Просмотр", Метаданные.ЖурналыДокументов.ПрослеживаемостьУведомления);
	ЕстьПравоПросмотрУведомленияОПеремещении = ПравоДоступа("Просмотр", Метаданные.Документы.УведомлениеОПеремещенииПрослеживаемыхТоваров);
	
	Элементы.ПомощникПолученияРНПТ.Видимость = ЕстьПравоПросмотрПомощникПолученияРНПТ;
	Элементы.УведомленияДляПолученияРНПТ.Видимость = ЕстьПравоПросмотрУведомленияДляПолученияРНПТ;
	Элементы.УведомленияОПеремещении.Видимость = ЕстьПравоПросмотрУведомленияОПеремещении;
	
	МобильныйКлиентАдаптацияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПомощникПолученияРНПТ(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Обработка.ПомощникПолученияРНПТ.Форма", ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура УведомленияДляПолученияРНПТ(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("ЖурналДокументов.ПрослеживаемостьУведомления.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура УведомленияОПеремещении(Команда)
	
	ПростойИнтерфейсКлиент.ОткрытьФормуВОкнеФормы("Документ.УведомлениеОПеремещенииПрослеживаемыхТоваров.ФормаСписка",
		ЭтотОбъект, , , ОткрытыеФормы);
	
КонецПроцедуры

#КонецОбласти

#Область МобильныйКлиент

&НаСервере
Процедура МобильныйКлиентАдаптацияФормы()
	
	Если Не ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Возврат;
	КонецЕсли;
	
	АдаптироватьМКШапкаФормы();
	
КонецПроцедуры

&НаСервере
Процедура АдаптироватьМКШапкаФормы()
	
	МобильныйКлиентБПФормаПанели.НастроитьФорму(ЭтотОбъект);
	МобильныйКлиентБПФормаПанели.УстановитьДоступностьЭлементовПанели(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти
