
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВидМаркетплейса") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "ВидМаркетплейса", Параметры.ВидМаркетплейса, ВидСравненияКомпоновкиДанных.Равно,,Истина);
		Элементы.ДобавитьПодключение.Вид = ВидГруппыФормы.ГруппаКнопок;
		Элементы.ФормаДобавитьOzon.Видимость   = (Параметры.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.OZON);
		Элементы.ФормаДобавитьWB.Видимость     = (Параметры.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.Wildberries);
		Элементы.ФормаДобавитьЯндекс.Видимость = (Параметры.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.ЯндексМаркет);
	КонецЕсли;
	
	Если Параметры.Свойство("СкрытьАвтозагрузку") Тогда
		СкрытьАвтозагрузку = Параметры.СкрытьАвтозагрузку;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьOzon(Команда)
	
	ОткрытьНастройкуМаркетплейса(ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.OZON"));
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьWB(Команда)
	
	ОткрытьНастройкуМаркетплейса(ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.Wildberries"));
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЯндекс(Команда)
	
	ОткрытьНастройкуМаркетплейса(ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.ЯндексМаркет"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуМаркетплейса(Маркетплейс)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ВидМаркетплейса", Маркетплейс);
	Если СкрытьАвтозагрузку Тогда
		ПараметрыФормы.Вставить("СкрытьАвтозагрузку", Истина);
	КонецЕсли;
		
	ОткрытьФорму("Справочник.НастройкиИнтеграцииМаркетплейс.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры
