// Содержимое модуля отличается в версиях ПРОФ и КОРП.
// В версии ПРОФ отсутствует:
// - тело экспортных процедур (остаются только сигнатуры методов)
// - неэкспортные процедуры и все функции.
// Поэтому не допускается реализация в модуле экспортных функций: вместо них следует использовать процедуры с возвращаемым параметром.

#Область ПрограммныйИнтерфейс

Процедура ПолучитьЕдиницуИзмеренияПоСтавкеАкциза(КодВидаПодакцизногоТовара, ЕдиницаИзмеренияАкциза) Экспорт
	ДатаДействия = '00010101';
	ТекДата = ТекущаяДата();
	Если ЗначениеЗаполнено(КодВидаПодакцизногоТовара) Тогда
		ДатаДействия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КодВидаПодакцизногоТовара, "ДействуетС");
	КонецЕсли;
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("КодТовара", КодВидаПодакцизногоТовара);
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(ДатаДействия) И ДатаДействия > ТекДата, ДатаДействия, ТекДата));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СтавкиАкцизаСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	РегистрСведений.СтавкиАкциза.СрезПоследних(&Дата, КодВидаПодакцизногоТовара = &КодТовара) КАК СтавкиАкцизаСрезПоследних";
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ЕдиницаИзмеренияАкциза = Результат.ЕдиницаИзмерения;
	Иначе
		ЕдиницаИзмеренияАкциза = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
