#Область ПрограммныйИнтерфейс

// см. ПроверкаКодовПоКлассификаторам.ВыполнитьПроверкуКодБК
//
Процедура ПриПроверкеКодаБК(РезультатПроверки, ПараметрыПроверки) Экспорт
	
	ТекстОшибки = ПлатежиВБюджетКлиентСервер.УведомлениеПроверитьКБК(ПараметрыПроверки.КБК, ПараметрыПроверки.Дата);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		РезультатПроверки.Успешно = Ложь;
		РезультатПроверки.ТекстОшибки = ТекстОшибки;
		Возврат;
	КонецЕсли;
	
	РезультатПроверки.Успешно = Истина;
	РезультатПроверки.ТекстОшибки = "";
	
КонецПроцедуры

// см. ПроверкаКодовПоКлассификаторам.ВыполнитьПроверкуКодПоОКТМО
//
Процедура ПриЗаполненииТекстаОшибкиПроверкиОКТМОПоАдресу(ТекстОшибки, ОжидаемыйКодПоОКТМО) Экспорт
	
КонецПроцедуры

// см. ПроверкаКодовПоКлассификаторам.ВыполнитьПроверкуКодПоОКТМО
//
Процедура ПриЗаполненииТекстаОшибкиПроверкиОКТМО(ТекстОшибки) Экспорт
	
КонецПроцедуры

#КонецОбласти