
//Для работы Толстого клиента обработчик события получения формы должен находиться
//в клиент-серверном модуле или в модуле с флагом Вызов сервера
Процедура ОбработкаПолученияФормыМобильныйКлиент(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	МобильныйКлиентБП.МобильныйКлиентБПСобытия(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
КонецПроцедуры

// Преобразует табличный документ в двоичные данные и возвращает адрес временного хранилища, куда они помещены.
//
// Параметры:
//  СохраняемыйДокумент - ТабличныйДокумент - преобразуемый в двоичные данные.
//  ТипФайла - ТипФайлаТабличногоДокумента - позволяет переопределить формат файла
//
// Возвращаемое значение:
//   Структура
//    АдресДвоичныхДанных - адрес временного хранилища, содержащего объект типа ДвоичныеДанные.
//    РасширениеФайла - Строка - расширение типа файла
//
Функция ДвоичныеДанныеИзТабличногоДокумента(СохраняемыйДокумент, ТипФайла = Неопределено) Экспорт
	
	Если ТипФайла = Неопределено Тогда
		ТипФайла = ТипФайлаТабличногоДокумента.XLSX;
	КонецЕсли;
	ДвоичныеДанныеФайла = БухгалтерскиеОтчеты.ДвоичныеДанныеИзТабличногоДокумента(СохраняемыйДокумент, ТипФайла);
	
	ТаблицаФорматов = УправлениеПечатью.НастройкиФорматовСохраненияТабличногоДокумента();
	СтрокиНастроекФормата = ТаблицаФорматов.НайтиСтроки(Новый Структура("ТипФайлаТабличногоДокумента", ТипФайла));
	Если СтрокиНастроекФормата.Количество() = 0 Тогда
		ВызватьИсключение "Необнаружено настроек формата для типа файла" + ТипФайла;
	КонецЕсли;
	
	НастройкиФормата = СтрокиНастроекФормата[0];
	
	Результат = Новый Структура();
	Результат.Вставить("АдресДвоичныхДанных", ПоместитьВоВременноеХранилище(ДвоичныеДанныеФайла));
	Результат.Вставить("РасширениеФайла", НастройкиФормата.Расширение);
	Возврат Результат;
	
КонецФункции

Функция ПараметрыПисьмаРазработчикам() Экспорт
	Параметры  = Новый Структура;
	Параметры.Вставить("ТекстТехническойИнформации",
		МобильныйКлиентБПФормаОбъекта.ТекстТехническойИнформации());
	Параметры.Вставить("ЕстьДоступныеУчетныеЗаписиДляОтправки",
		РаботаСПочтовымиСообщениямиВызовСервера.ЕстьДоступныеУчетныеЗаписиДляОтправки());
	Параметры.Вставить("ЭтоБизнесСтарт",
		ОбщегоНазначенияБП.ЭтоБизнесСтарт());
	
	Возврат Параметры;
КонецФункции

Процедура ПроверитьИЗарегистроватьСобытиеДляОценки(ИдентификаторОперации, ПоказыватьФормуОценки) Экспорт
	
	МобильныйКлиентБП.ПроверитьИЗарегистроватьСобытиеДляОценки(ИдентификаторОперации, ПоказыватьФормуОценки);
	
КонецПроцедуры